# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet..::..Erase Method
GroupSet Class See Also
---
Removes a specified group from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Group item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Group _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Group^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GroupThe group to be erased.
# ### Return Value
The number of groups that were erased from the set.
# See Also
GroupSet Class
Autodesk.Revit.DB Namespace